#include<stdio.h>
#include "menu.h"

void menu1(){
    printf("\n\n\n");
    printf("\t\t-----------------------------------------------------------------------\n");
    printf("\t\t欢迎您，亲爱的用户！                                                     \n");
    printf("\t\t                                                                       \n");
    printf("\t\t                      欢 迎 使 用 图 书 管 理 系 统                      \n");
    printf("\t\t                                                                       \n");
    printf("\t\t                               [1] 注册                                 \n");
    printf("\t\t                               [2] 登录                                 \n");
    printf("\t\t                               [3] 退出                                 \n");
    printf("\t\t                     请输入选项前的编号，按回车键结束                      \n");
    printf("\t\t------------------------------------------------------------------------\n");
}

// 登录界面菜单，后续自动判断身份
void menu2(){
    printf("\n\n\n");
    printf("\t\t------------------------------------------------------------------------\n");
    printf("\t\t欢迎您，亲爱的用户！                                                      \n");
    printf("\t\t                          请 选 择 你 的 身 份                           \n");
    printf("\t\t                                                                        \n");
    printf("\t\t                           [1] 超级管理员登录                            \n");
    printf("\t\t                           [2] 管理员登录                                \n");
    printf("\t\t                           [3] 普通用户登录                              \n");
    printf("\t\t                           [4] 返回上一级                                \n");
    printf("\t\t                      请输入选项前的编号，按回车键结束                     \n");
    printf("\t\t------------------------------------------------------------------------\n");
}

// root用户界面
void menu3(){
    printf("\n\n\n");
    printf("\t\t-------------------------------------------------------------------------\n");
    printf("\t\t欢迎您，亲爱的用户！                                                       \n");
    printf("\t\t                     请 选 择 你 要 进 行 的 操 作                         \n");
    printf("\t\t                                                                         \n");
    printf("\t\t                           [1] 查看所有用户信息                            \n");
    printf("\t\t                           [2] 删除用户                                   \n");
    printf("\t\t                           [3] 添加图书管理员                              \n");
    printf("\t\t                           [4] 退出登录                                   \n");
    printf("\t\t                  请输入选项前的编号，按回车键结束                          \n");
    printf("\t\t-------------------------------------------------------------------------\n");
}

void menu4(){
    printf("\n\n");
    printf("\t\t *=======================================================*\n");
    printf("\t\t| | * - * - * - * - * 管-理-员-界-面 * - * - * - * - * - | |\n");
    printf("\t\t| *                                                     * |\n");
    printf("\t\t| |                [1]   添加图书                        | |\n");
    printf("\t\t| *                [2]   删减图书                        * |\n");
    printf("\t\t| |                [3]   修改图书信息                    | |\n");
    printf("\t\t| *                [4]   查找图书信息                    * |\n");
    printf("\t\t| |                [5]   显示全部图书                    | |\n");
    printf("\t\t| *                [6]   显示所有会员信息                * |\n");
    printf("\t\t| |                [7]   显示所有借阅信息                | |\n");
    printf("\t\t| *                [8]   退出管理员界面                  * |\n");
    printf("\t\t| |                                                     | |\n");
    printf("\t\t| * - * - * - * - * -- * - * - * - * - * - * - * - * - * - |\n");
    printf("\t\t *=======================================================*\n");
}

void menu5(){
    printf("\n\n");
	printf("\t\t *=======================================================*\n");
    printf("\t\t| | * - * - * - * - * -会-员-界-面- * - * - * - * - * - | |\n");
    printf("\t\t| *                                                    * |\n");
    printf("\t\t| |                 [1]   查找图书                      | |\n");
    printf("\t\t| *                 [2]   借阅图书                      * |\n");
    printf("\t\t| |                 [3]   归还图书                      | |\n");
    printf("\t\t| *                 [4]   查看所有图书信息               * |\n");
    printf("\t\t| *                 [5]   图书受欢迎度排行榜             * |\n");
    printf("\t\t| *                 [6]   查看我的借阅                  * |\n");
    printf("\t\t| |                 [7]   退出登录                      | |\n");
    printf("\t\t| * - * - * - * - * - * - * - * - * - * - * - * - * - * |\n");
	printf("\t\t *======================================================*\n");
}
